In [1]:
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
csvfile = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(csvfile)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [2]:
purchase_data.isnull().sum()
#used isnull to make sure there was a full data set, no missing values

Purchase ID    0
SN             0
Age            0
Gender         0
Item ID        0
Item Name      0
Price          0
dtype: int64

In [3]:
#Looking for total PLAYERS, table shows SN's, but these are the number of PURCHASES
#(use nunique function to separate the values in SN)

purchase_data.SN.nunique()
#UNIQUE will look for ALL different SN's within the column, NUNIQUE gives me the actual total of SN's (grouping)
#duplicate screen nanes together
summary_table = pd.DataFrame({"Total Number of Players" : [purchase_data.SN.nunique()]})
summary_table
#created summary table #1

   Total Number of Players
0                      576

In [4]:
purchase_data.Price.mean()
# look at it as purchase_data is the starting point, and Price (column) is the noun, 
#and . mean is the VERB; took mean of Price column

3.050987179487176

In [5]:
purchase_data["Item ID"].nunique() 
#there are 183 different items(purchases) in column Item ID

183

In [6]:
purchase_data["Purchase ID"].count()
#used .count this time because all we needed is total 
#number of Purchase ID (could also use nunique due to each purchase ID being unique.)

780

In [7]:
purchase_data.Price.sum()

2379.77

In [8]:
summary_table2 = pd.DataFrame({"Number of Unique Items":[purchase_data["Item ID"].nunique()],
                                "Avarage Price":[purchase_data.Price.mean()],
                               "Number of Purchases":[purchase_data["Purchase ID"].count()],
                              "Total Revenue":[purchase_data.Price.sum()]})
summary_table2

   Number of Unique Items  Avarage Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [9]:
purchase_data.groupby ("Gender").SN.nunique()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [10]:
gendertotals = purchase_data.groupby ("Gender").SN.nunique()

In [11]:
gendertotals/576
#Because we made gendertotals into an object or variable, I can use
#this to calculate the percent by dividing by the total players (576)

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [12]:
#Created two summary tables to get "Total Count" and "Percentage of Players" and merged the two together to display 
#both
summary_table3 = pd.DataFrame({"Total Count":purchase_data.groupby ("Gender").SN.nunique()})
summary_table4 = pd.DataFrame({"Percentage of Players":(gendertotals/576)*100})
summary_table_merge = pd.merge(summary_table3,summary_table4, on="Gender")
summary_table_merge

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [13]:
#checking original columns for easy reference
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [14]:
purchase_data.groupby("Gender")["Purchase ID"].count()

#provides purchase count by gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [15]:
purchase_data.groupby("Gender")["Price"].mean()
#mean provides by gender what the avarage purchase was

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [16]:
purchase_data.groupby("Gender")["Price"].sum()
#Gives total spent by males, females, other

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [17]:
avgtotal = purchase_data.groupby ("Gender")["Price"].sum()

In [18]:
gendercount = purchase_data.groupby("Gender")["SN"].nunique()
gendercount

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [19]:
avgtotal/gendercount
#created two objects to divide and get totals per person by gender

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [20]:
summary_table5 = pd.DataFrame({"Purchase Count":purchase_data.groupby("Gender")["Purchase ID"].count()})
summary_table6 = pd.DataFrame({"Average Purchase Price":purchase_data.groupby("Gender")["Price"].mean()})
summary_table7 = pd.DataFrame({"Total Purchase Value":purchase_data.groupby("Gender")["Price"].sum()})
summary_table8 = pd.DataFrame({"Avg Total Purchase per Person":avgtotal/gendercount})

summary_table_merge2 = pd.merge(summary_table5,summary_table6, on="Gender")
summary_table_merge3 = pd.merge(summary_table7,summary_table8, on="Gender")

summary_table_combined = pd.merge(summary_table_merge2,summary_table_merge3, on="Gender")
summary_table_combined

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [21]:
summary_table9  =  purchase_data.loc[:, ["Gender", "SN", "Age"]]
summary_table9 = summary_table9.drop_duplicates()
summary_table9.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [22]:
#created bins and labels for the new column in purchase_data
age_bins = [0,9.99,14.99,19.99,24.99,29.99,34.99,39.99,100]

age_labels = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [23]:
summary_table9["Age Ranges"] = pd.cut(summary_table9["Age"], age_bins, labels=age_labels)
summary_table9.head()

  Gender             SN  Age Age Ranges
0   Male        Lisim78   20      20-24
1   Male    Lisovynya38   40        40+
2   Male     Ithergue48   24      20-24
3   Male  Chamassasya86   24      20-24
4   Male      Iskosia90   23      20-24

In [24]:
gender_counts = summary_table9["Age Ranges"].value_counts()
gender_counts

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [25]:
gender_percent = ((gender_counts/576)*100)
gender_percent

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Ranges, dtype: float64

In [26]:
summary_table10 = pd.DataFrame({"Total Count": gender_counts, 
                                     "Percentage of Players": gender_percent})
summary_table10.round(2).sort_index()

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

In [27]:
# Used same age_bin to bin purchasing data 
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], age_bins, labels=age_labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [28]:
#calculated Purchase count by age
purchase_data.groupby(["Age Ranges"]).count()["Price"]

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [29]:
#Calculated Average Purchase Price by age
purchase_data.groupby(["Age Ranges"]).mean()["Price"]

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [30]:
#Calculated Total Purchase Value by age
purchase_data.groupby(["Age Ranges"]).sum()["Price"]

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [31]:
#Calculated Avg. Total Purchase per Person by age
purchase_data.groupby(["Age Ranges"]).sum()["Price"]/gender_counts

10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
<10      4.537059
dtype: float64

In [32]:
#Grouped all info into a Data Frame
summary_table11 = pd.DataFrame({"Purchase Count":purchase_data.groupby(["Age Ranges"]).count()["Price"]})
summary_table12 = pd.DataFrame({"Average Purchase Price":purchase_data.groupby(["Age Ranges"]).mean()["Price"]})
summary_table13 = pd.DataFrame({"Total Purchase Value":purchase_data.groupby(["Age Ranges"]).sum()["Price"]})
summary_table14 = pd.DataFrame({"Avg Total Purchase per Person":
                                purchase_data.groupby(["Age Ranges"]).sum()["Price"]/gender_counts.sort_index()})

summary_table_merge4 = pd.merge(summary_table11,summary_table12, on="Age Ranges")
summary_table_merge5 = pd.merge(summary_table13,summary_table14, on="Age Ranges")

summary_table_combined2 = pd.merge(summary_table_merge4,summary_table_merge5, on="Age Ranges")
summary_table_combined2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [33]:
#Calculated Purchase Count by SN (top spenders)
purchase_data.groupby(["SN"]).count()["Price"].head(5)

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Price, dtype: int64

In [34]:
#Calculated Average Purchase Price (top spenders)
purchase_data.groupby(["SN"]).mean()["Price"].head(5)

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [35]:
#Calculated Total Purchase Value and sorted to obtain correct order (top spenders)
purchase_data.groupby(["SN"]).sum()["Price"].head(5)

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [36]:
summary_table15 = pd.DataFrame({"Purchase Count":purchase_data.groupby(["SN"]).count()["Price"]})
summary_table16 = pd.DataFrame({"Average Purchase Price":purchase_data.groupby(["SN"]).mean()["Price"]})
summary_table17 = pd.DataFrame({"Total Purchase Value":purchase_data.groupby(["SN"]).sum()["Price"]})

summary_table_merge6 = pd.merge(summary_table15,summary_table16, on="SN")
summary_table_merge7 = pd.merge(summary_table_merge6,summary_table17,on="SN")

summary_table_merge7.sort_values("Total Purchase Value", ascending=False).head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [37]:
#Calculated Purchase Count
purchase_data.groupby(["Item ID", "Item Name"]).count()["Price"].head(5)

Item ID  Item Name
0        Splinter              4
1        Crucifer              3
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Price, dtype: int64

In [38]:
#Calculated Item Price
purchase_data.groupby(["Item ID", "Item Name"]).mean()["Price"].head(5)

Item ID  Item Name
0        Splinter              1.28
1        Crucifer              3.26
2        Verdict               2.48
3        Phantomlight          2.49
4        Bloodlord's Fetish    1.70
Name: Price, dtype: float64

In [39]:
#Calculated Total Purchase Value
purchase_data.groupby(["Item ID", "Item Name"]).sum()["Price"].head(5)

Item ID  Item Name
0        Splinter               5.12
1        Crucifer               9.78
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Price, dtype: float64

In [40]:
summary_table18 = pd.DataFrame({"Purchase Count":purchase_data.groupby(["Item ID", "Item Name"]).count()["Price"]})
summary_table19 = pd.DataFrame({"Item Price":purchase_data.groupby(["Item ID", "Item Name"]).mean()["Price"]})
summary_table20 = pd.DataFrame({"Total Purchase Value":purchase_data.groupby(["Item ID", "Item Name"]).sum()["Price"]})

summary_table_merge8 = pd.merge(summary_table18,summary_table19, on=["Item ID", "Item Name"])
summary_table_merge9 = pd.merge(summary_table_merge8,summary_table20,on=["Item ID", "Item Name"])

summary_table_merge9.sort_values("Purchase Count", ascending=False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [41]:
summary_table_merge9.sort_values("Total Purchase Value", ascending=False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80